In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4, np.nan],
                   [7.1, -4.5],
                   [np.nan, np.nan],
                   [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [5]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [10]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [8]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [13]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [14]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [15]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [16]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [15]:
price = pd.read_pickle("yahoo_price.pkl")
volume = pd.read_pickle("yahoo_volume.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [16]:
result = price.pct_change()
result.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [17]:
result["MSFT"].corr(result["IBM"])

0.49976361144151144

In [18]:
result["MSFT"].cov(result["IBM"])

8.870655479703546e-05

In [19]:
result.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [28]:
result.corrwith(result["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [29]:
result.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [20]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [21]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [22]:
string_data = pd.Series(["aabbccdd", np.nan, None, "apple"])
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [23]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [24]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [26]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [30]:
df.fillna(0)

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

In [31]:
df.fillna({'one': 0.5, 'two': 0})

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.50  0.0
d  0.75 -1.3

In [32]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [4]:
data = {'Country': ['Russia', 'USA', 'China', 'India', 'Brazil'],
        'Life Expectancy': [71.0, 79.0, 76.0, 68.5, 75.2],
        'Population': [144.5, 327.2, 1402.0, 1371.3, 211.0]}
df = pd.DataFrame(data)
df

  Country  Life Expectancy  Population
0  Russia             71.0       144.5
1     USA             79.0       327.2
2   China             76.0      1402.0
3   India             68.5      1371.3
4  Brazil             75.2       211.0

In [5]:
pivot_table = pd.pivot_table(df, values=['Life Expectancy', 'Population'], index='Country')
pivot_table

         Life Expectancy  Population
Country
Brazil              75.2       211.0
China               76.0      1402.0
India               68.5      1371.3
Russia              71.0       144.5
USA                 79.0       327.2

In [7]:
data = {'Country': ['Russia', 'USA', 'China', 'India', 'Brazil'],
        'Year': [2000, 2000, 2000, 2010, 2010],
        'Life Expectancy': [71.0, 79.0, 76.0, 68.5, 75.2],
        'Population': [144.5, 327.2, 1402.0, 1371.3, 211.0]}
df = pd.DataFrame(data)
print(df)
pivot_table = pd.pivot_table(df, values='Life Expectancy', index=['Country', 'Year'], columns='Year', aggfunc='mean')
pivot_table

  Country  Year  Life Expectancy  Population
0  Russia  2000             71.0       144.5
1     USA  2000             79.0       327.2
2   China  2000             76.0      1402.0
3   India  2010             68.5      1371.3
4  Brazil  2010             75.2       211.0

Year          2000  2010    2000    2010
Country Year
Brazil  2010   NaN  75.2     NaN   211.0
China   2000  76.0   NaN  1402.0     NaN
India   2010   NaN  68.5     NaN  1371.3
Russia  2000  71.0   NaN   144.5     NaN
USA     2000  79.0   NaN   327.2     NaN

In [ ]:
filtered_data = df[(df['Country'] == 'Russia') & (df['Year'] == 2000)]
pivot_table = pd.pivot_table(filtered_data, values='Life Expectancy', index='Country', columns='Year', aggfunc='mean')
pivot_table

In [40]:
df_pivot = df.pivot(index='Country',
                   values='Population',
                   columns='Year')
df_pivot

Year       2000    2010
Country
Brazil      NaN   211.0
China    1402.0     NaN
India       NaN  1371.3
Russia    144.5     NaN
USA       327.2     NaN

In [17]:
data = {'Месяц': ['Январь', 'Февраль', 'Март', 'Апрель'],
       'Продажи': [100, 200, 150, 300]}
df = pd.DataFrame(data)
data2 = {'Месяц': ['Апрель', 'Май', 'Июнь', 'Июль'],
       'Продажи': [250, 150, 200, 350]}
df2 = pd.DataFrame(data2)

In [18]:
df

     Месяц  Продажи
0   Январь      100
1  Февраль      200
2     Март      150
3   Апрель      300

In [19]:
df2

    Месяц  Продажи
0  Апрель      250
1     Май      150
2    Июнь      200
3    Июль      350

In [30]:
df3 = df.join(df2.set_index('Месяц'), on='Месяц', rsuffix='_2',how='outer').set_index('Месяц')
df3

         Продажи  Продажи_2
Месяц
Апрель     300.0      250.0
Июль         NaN      350.0
Июнь         NaN      200.0
Май          NaN      150.0
Март       150.0        NaN
Февраль    200.0        NaN
Январь     100.0        NaN

In [20]:
pd.concat([df,df2])

     Месяц  Продажи
0   Январь      100
1  Февраль      200
2     Март      150
3   Апрель      300
0   Апрель      250
1      Май      150
2     Июнь      200
3     Июль      350

In [36]:
df4 = pd.merge(df, df2,left_on='Месяц', right_on='Месяц',how='outer')
df4

     Месяц  Продажи_x  Продажи_y
0   Апрель      300.0      250.0
1     Июль        NaN      350.0
2     Июнь        NaN      200.0
3      Май        NaN      150.0
4     Март      150.0        NaN
5  Февраль      200.0        NaN
6   Январь      100.0        NaN

In [16]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7']})
print(df1)
print(df2)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
    A   B
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

In [97]:
pd.concat([df1, df2], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

In [98]:
pd.concat([df1, df2], axis=1)

    A   B   A   B
0  A0  B0  A4  B4
1  A1  B1  A5  B5
2  A2  B2  A6  B6
3  A3  B3  A7  B7

In [99]:
df3 = df1._append(df2)
df3

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

In [100]:
df = pd.DataFrame(columns=['A', 'B'])
df

Empty DataFrame
Columns: [A, B]
Index: []

In [101]:
df = df._append({'A': 1, 'B': 2}, ignore_index=True)
df

   A  B
0  1  2